OpenFOAMcases/BFSTMR/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (36.0 0 0);

boundaryField
{
    inlet
    {
      type              fixedValue;
	  value             $internalField;
    }

	outlet
	{
	  type              zeroGradient;		
	}

    "(bottom|top)"
    {
        type            noSlip;
    }

    "(front|back)"
    {
        type            empty;
    }

    "(center1|center2)"
    {
        type            symmetry;
    }
}


// ************************************************************************* //
