OpenFOAMcases/BFSTMR/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
      type              fixedValue;
	  value             uniform 0;
    }

	inlet
	{
	  type              zeroGradient;		
	}

    "(bottom|top)"
    {
        type            zeroGradient;
    }

    "(front|back)"
    {
        type            empty;
    }

    "(center1|center2)"
    {
        type            symmetry;
    }
}


// ************************************************************************* //
