OpenFOAMcases/BFSTMR/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    inlet
    {
      type              fixedValue;
	  value             $internalField;
    }

	outlet
	{
	  type              zeroGradient;		
    }
	
	"(bottom|top)"
    {
      type            fixedValue;
      value           uniform 0;
    }

    "(front|back)"
    {
        type            empty;
    }

    "(center1|center2)"
    {
        type            symmetry;
    }
}


// ************************************************************************* //
