OpenFOAMcases/BFSTMR/system/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

    // Mandatory entries
    type            wallShearStress;
    libs            (fieldFunctionObjects);

    // Optional entries
    patches          (bottom);


// ************************************************************************* //
